Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem.Copy Method
 Copy the library profile item in the profile database to item with new name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Copy(
	string newName
)
Public Function Copy (
	newName As String
) As Boolean
Parameters
newName
Type: System.String
The new name of the copied profile item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           LibraryProfileItem item = new LibraryProfileItem();
           if (item.Select("HEA100"))
           {
               string newName = "HEA100C";
               if (item.Copy(newName))
               {
                   LibraryProfileItem copy = new LibraryProfileItem();
                   if (copy.Select(newName))
                   {
                       Console.WriteLine("HEA100 copied successfully to HEA100C");
                   }
               }
           }
       }
}
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace